#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kiIIer/kubernetes-ops-staging-25-eks-cluster-autoscaler/runs/run-1vQcjgLioX4heK5k

Waiting for the plan to start...

Terraform v1.8.4
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.eks: Read complete after 1s
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_partition.current: Reading...
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_caller_identity.current: Reading...
module.cluster-autoscaler.data.aws_caller_identity.current: Reading...
module.cluster-autoscaler.data.aws_iam_policy_document.cluster_autoscaler: Reading...
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster-autoscaler.data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=3248901210]
module.cluster-autoscaler.aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::533267183023:policy/cluster-autoscaler-staging20240529144949217200000001]
module.cluster-autoscaler.data.aws_caller_identity.current: Read complete after 0s [id=533267183023]
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_caller_identity.current: Read complete after 0s [id=533267183023]
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=2688101150]
module.cluster-autoscaler.module.iam_assumable_role_admin.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler-staging]
module.cluster-autoscaler.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cluster-autoscaler-staging-20240529144949457500000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-autoscaler.module.cluster-autoscaler.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                awsRegion: eu-north-1
                
                rbac:
                  create: true
                  serviceAccount:
                    # This value should match local.k8s_service_account_name in locals.tf
                    name: cluster-autoscaler-aws-cluster-autoscaler
                    annotations:
                      # This value should match the ARN of the role created by module.iam_assumable_role_admin in irsa.tf
                      eks.amazonaws.com/role-arn: "arn:aws:iam::533267183023:role/cluster-autoscaler-staging"
                
                autoDiscovery:
                  clusterName: staging
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "9.24.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```


</details>

*Pusher: @kiIIer, Action: `pull_request`*